# ExportObjectData Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions..::..ExportObjectData Property
DWFExportOptions Class See Also
---
Whether to include properties associated with elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool ExportObjectData { get; set; }
```

Visual Basic
---
```text
Public Property ExportObjectData As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportObjectData {
	bool get ();
	void set (bool value);
}
```

# Remarks
ExportObjectData must be enabled (true) in order to also enable exporting rooms and areas (ExportingAreas). If ExportObjectData is disabled, the ExportingAreas property will be ignored.
# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace